InformationRegisters/ЛБ_СтатусыОбъектовЗалогаВНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаВНакладной</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаОткрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенИзНакладной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вставки</Name>
					<Comment>Вставки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КомплектующиеИзделия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОгранки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Comment>Длина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Comment>Ширина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЦвета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппаЦвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаКачества</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппаКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КачествоОгранки</Name>
							<Comment>Качество огранки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество камней</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Comment>Вес</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеМеталлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Comment>Проба</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЧистый</Name>
							<Comment>Вес</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесВПробеЧистоты</Name>
							<Comment>Вес в пробе чистоты</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ЛБ_ФормаЗапускаИсторииДвиженияЗалога/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборОЗ = 1; 
	//Элементы.ДекорацияПоиск.Заголовок = "Объект залога не определен";
	УстановитьДоступность();  
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность() 
	//Если ОтборОЗ = 1 Тогда 
	//	Элементы.НомерЗБ.ТолькоПросмотр  = Истина;
	//	Элементы.Артикул.ТолькоПросмотр  = Ложь;
	//Иначе                  
	//	Элементы.Артикул.ТолькоПросмотр  = Истина; 
	//	Элементы.НомерЗБ.ТолькоПросмотр  = Ложь;
	//КонецЕсли;
	Если ОтборОЗ = 1 Тогда 
		Элементы.НомерЗБ.Доступность  = Ложь;
		Элементы.Артикул.Доступность = Истина;
	Иначе                  
		Элементы.НомерЗБ.Доступность  = Истина;
		Элементы.Артикул.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимость() 
	Если СписокАртикулов.Количество() = 0 Тогда 
		Элементы.ВыбратьАртикул.Видимость = ложь;
	Иначе                  
		Элементы.ВыбратьАртикул.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДатуОтгрузки()  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период КАК ДатаНач
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(
	               |			,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНач УБЫВ";
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.Статус = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Отгружено Тогда
			Возврат Выборка.ДатаНач;
		КонецЕсли;	
	КонецЕсли;	                    
	Возврат Дата(1,1,1);
КонецФункции   

&НаКлиенте
Процедура Сформировать(Команда)   
	Если ЗначениеЗаполнено(ЗалоговыйБилет) И ЗначениеЗаполнено(ОбъектЗалога) Тогда  
		Если ПолучитьДатуОтгрузки() = Дата(1,1,1) Тогда
			Предупреждение("Залоговый билет № " + СокрЛП(НомерЗБ) + " не был отгружен из ломбарда", 60);
	    Иначе	
			ПараметрыВыбора = Новый Структура;
			ПараметрыВыбора.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);
			ПараметрыВыбора.Вставить("ОбъектЗалога", ОбъектЗалога);	 
	
	        ЭтаФорма.Закрыть(ПараметрыВыбора); 
		КонецЕсли;	
	Иначе 
		Предупреждение("Не определен объект залога для формирования отчета!", 60);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	Артикул = "";
	НомерЗБ = "";
	ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка"); 
	ЗалоговыйБилет = ПредопределенноеЗначение("Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка"); 
	СписокАртикулов.Очистить();
	УстановитьДоступность(); 
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНомерЗБ() 
	Возврат ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции	

&НаКлиенте
Процедура АртикулОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) 
	Артикул = Текст;
	Результат = ПолучитьИнформациюЗалогаПоАртикулу();
	Если НЕ Результат = неопределено Тогда
		ЗалоговыйБилет = Результат.ЗалоговыйБилет;
	    ОбъектЗалога = Результат.ОбъектЗалога;	
		НомерЗБ = ЗаполнитьНомерЗБ(); 
		//Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	Иначе      
		НомерЗБ = "";
		ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка"); 
	    ЗалоговыйБилет = ПредопределенноеЗначение("Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка"); 
		//Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБПоНомеру() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьЗБПоНомеру(НомерЗБ);
КонецФункции 

&НаСервере
Процедура ПолучитьАртикулы() 
	СписокАртикулов.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокАртикулов.Добавить(СокрЛП(Выборка.Артикул));
	Конеццикла; 
	СписокАртикулов.СортироватьПоЗначению();
КонецПроцедуры	

&НаКлиенте
Процедура НомерЗБОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	НомерЗБ = Текст;   
	ЗалоговыйБилет = ПолучитьЗБПоНомеру(); 
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда 
		ПолучитьАртикулы(); 
		
		Если  СписокАртикулов.Количество() >  1 Тогда
			ВыбранноеЗначение = ВыбратьИзСписка(СписокАртикулов, Элементы.Артикул); 

			Если ВыбранноеЗначение <> Неопределено Тогда 
			   Артикул = ВыбранноеЗначение.Значение; 
			   Результат = ПолучитьИнформациюЗалогаПоАртикулу();
			   Если НЕ Результат = неопределено Тогда 
				   ОбъектЗалога = Результат.ОбъектЗалога;
			   КонецЕсли;	   
		   КонецЕсли;   
		   //Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	   ИначеЕсли  СписокАртикулов.Количество() =  1 Тогда  
		   Артикул = СписокАртикулов.Получить(0).Значение; 
		   Результат = ПолучитьИнформациюЗалогаПоАртикулу();
		   Если НЕ Результат = неопределено Тогда 
			   ОбъектЗалога = Результат.ОбъектЗалога;
		   КонецЕсли;	
		  //Элементы.ДекорацияПоиск.Заголовок = "Объект залога определен";
	   Иначе
		   //Элементы.ДекорацияПоиск.Заголовок = "Объект залога не определен";
       КонецЕсли;
    Иначе
	   Артикул = ""; 
	   ОбъектЗалога = ПредопределенноеЗначение("Справочник.ЛБ_ОбъектыЗалога.ПустаяСсылка"); 
	   ЗалоговыйБилет = ПредопределенноеЗначение("Документ.ЛБ_ОперацияПоЗалогу.ПустаяСсылка");  
	   //Элементы.ДекорацияПоиск.Заголовок = "Объект залога не определен";
	   СписокАртикулов.Очистить();
   КонецЕсли;	  
   УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюЗалогаПоАртикулу()
    Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Артикул", СокрЛП(Артикул));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, Артикул = &Артикул) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СтруктураВ = Новый структура;
		СтруктураВ.Вставить("ЗалоговыйБилет", Выборка.ЗалоговыйБилет);
		СтруктураВ.Вставить("ОбъектЗалога", Выборка.ОбъектЗалога);
		Возврат СтруктураВ;
	КонецЕсли;
	Возврат неопределено;
КонецФункции

&НаКлиенте
Процедура ВыбратьАртикул(Команда)
	Если  СписокАртикулов.Количество() > 0 Тогда
		ВыбранноеЗначение = ВыбратьИзСписка(СписокАртикулов, Элементы.Артикул); 

		Если ВыбранноеЗначение <> Неопределено Тогда 
		   Артикул = ВыбранноеЗначение.Значение; 
		   Результат = ПолучитьИнформациюЗалогаПоАртикулу();
		   Если НЕ Результат = неопределено Тогда 
			   ОбъектЗалога = Результат.ОбъектЗалога;
		   КонецЕсли;	   
	   КонецЕсли;   
	КонецЕсли;   
КонецПроцедуры
